// 01-module-02-lesson
"use strict";

//1. Напишите цикл, который выводит в консоль
//числа от max до min по убыванию
// Выведите в консоль всех четных чисел от min до max
// const max = 50;
// const min = 23;


//2. Напишіть код, який запитуватиме
//Логін за допомогою prompt і логувати результат
//В консоль браузера
// введені данні можуть бути будь якого формату(великі і малі літери)

//Якщо відвідувач вводить "адмін",
//то prompt запитує пароль.
//Якщо нічого не ввели або натиснута клавіша Esc
//Вивести рядок "Скасовано"
//  Інакше вивести рядок "Я вас не знаю"

//Пароль перевіряти так:
//Якщо введено пароль "Я головний",
//то вивести рядок "Здрастуйте!"
//інакше виводити рядок "Невірний пароль!"


// 3. Рядок, що складається з символів, наприклад, "abcde".
// Перевірте, чи перший символ цього рядка - це буква "a".
// Якщо так - логуйте  "так", інакше виведіть "ні".

// function str (string,firstLetter) {

    
// }
// str("fsdccwdcver","g")

// 4.Написати програму розрахунку об'єму циліндра, всі дані (крім числа PI) вводяться з клавіатури руками. (Число Пі в js виглядає так: Math.PI). Також потрібно вивести інформацію у такому вигляді:
//**************

// Об'єм циліндра з площею основи *S* (вивіть значення), радіусом *R* та висотою *H* дорівнює:

//--------------------

// V = результат.

// -------------------

// end.

// P.S. Усі зірочки та рисочки потрібно намалювати. Використати (document.write())

// Задача 4. Порахувати сумму непарних чисел от 0 до 250.

function getRandomHexColor() {
    return `#${Math.floor(Math.random() * 16777215).toString(16)}`;
  };